Revit 2024 API
BuiltInFailures.WallFailures.UnableToDeleteWallForPanel Property
 Unable to delete curtain panel wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UnableToDeleteWallForPanel { get; }
Visual Basic
Public Shared ReadOnly Property UnableToDeleteWallForPanel As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UnableToDeleteWallForPanel {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace